import telebot
import requests
import json
import random
import re
from collections import OrderedDict
import difflib

definitions_db = [  "звичайне диференціальне рівняння першого порядку, розв'язане стосовно похідної",
                    "розв'язок диференціального рівняння першого порядку, розв'заного стосовно похідної",
                    "диференціальне рівняння першого порядку з відокремленими змінними",
                    "однорідне диференціальне рівняння",
                    "лінійне диференціальне рівняння першого порядку",
                    "розв'язок лінійного диференціальне рівняння",
                    "задача коші",
                    "рівняння бернуллі",
                    "диференціальне рівняння першого порядку в симетричній формі",
                    "інтеграл диференціального рівняння в симетричній формі",
                    "диференціальне рівняння з відокремлюваними змінними в симетричній формі",
                    "однорідне рівняння в симетричній формі",
                    "рівняння в повних диференціалах",
                    "інтегрувальний множник",
                    "інтегральне рівняння",
                    "функція, яка задовільняє умову ліпшиця",
                    "одностайно неперервна послідовність функцій",
                    "продовжуваний\непродовжуваний розв'язок",
                    "загальний розв'язок рівняння першого порядку",
                    "неявне диференціальне рівняння першого порядку (рівняння, не розв'язане стосовно похідної)",
                    "розв'язок неявного рівняння",
                    "рівняння лагранжа",
                    "рівняння клеро",
                    "нормальна система звичайних диференціальних рівняннь",
                    "розв'язок норм системи диференціальних рівняннь",
                    "загальний розв'язок системи",
                    "звичайне диференціальне рівняння n-го порядку, розв'язане стосовно старшої похідної",
                    "розв'язок звичайного диференціального рівняння n-го порядку, розв'язаного стосовно старшої похідної",
                    "загальний розв'язок звичайного диференціального рівняння n-го порядку, розв'язаного стосовно старшої похідної",
                    "узагальнене однорідне рівняння",
                    "нормальна система звичайних диференціальних рівняннь",
                    "лінійно залежна сукупність функцій",
                    "фундаментальна система розв'язків",
                    "лінійне диференціальне рівняння  n-го порядку",
                    "визначник вронського",
                    "рівняння ейлера",
                    "рівняння чебишова",
                    "динамічна (автономна) нормальна система звичайних диференціальних рівняннь",
                    "траєкторія динамічної системи",
                    "стан рівноваги динамічної системи",
                    "типи точок рівноваги на площині",
                    "періодичний розв'язок динамічної системи",
                    "гранична точка траєкторії",
                    "перший інтеграл динамічної системи",
                    "стійкий розв'язок норм системи за ляпуновим",
                    "система диференціальних рівнянь у симетричній формі",
		    "асимптотично стійкий розв'язок",
                    "крайова задача",
		    "власне значення крайової задачі",
		    "власні функції крайової задачі",
		    "самоспряжена крайова задача",
		    "функція гріна",
		    "диференціальне рівняння з частинними похідними першого порядку",
		    "загальний розв'язок диференціального рівняння з частинними похідними першого порядку",
		    "характеристична система рівняння з частинними похідними",
		    "перший інтеграл системи рівняннь з частинними похідними",
                    "незалежність перших інтегралів з частинними похідними"]

theorems_db = [ "лема про неявний розв'язок рівняння в симетричній формі",
		"лема про інтеграл др у симетричній формі ",
                "теорема про інтеграл рівняння з відокремлюваними змінними",
                "необх. і достатня умова рівняння у пов диференціалах",
		"теор про інтеграл рівняння у повних диференціалах",
		"лема умова ліпшиця на довільній обмеженій підмножині",
                "теорема асколі-арцела",
                "теорема гронуолла-белмана",
		"теорема пеано (локальна)",
		"теорема існування непродовжуваного розв'язку",
                "теорема єдиності розв'язку задачі коші",
                "теорема існування загального розв'язку др першого порядку",
		"теорема єдиності розв'язку задачі коші для неявного др першого порядку",
		"лема про оцінку модуля інтеграла неперервної функції",
		"теорема пеано (локальна, для нормальної системи)",
                "теорема пеано (глобальна)",
                "теорема пікара (локальна)",
		"лема про еквівалентність звичайного др вищого порядку до нормальної системи",
		"теорема існування і єдиності розв'язку задачі коші др вищих порядків",
                "теорема існування та єдиності непровжуваного розв'язку задачі коші лінійної системи д.р.",
                "теорема про нульовий розв'язок нормальної лінійної системи",
		"теорема про суму розв'язків нормальної лінійої системи",
		"теорема про лінійну залежність(незалежність) розв'язків",
                "теорема про існування фундаментальної системи розв'язків",
                "необхідна і достатня умова лінійної незалежності сукупності розв'язків нормальної лінійної системи",
		"теорема про структуру загалього розв'язку однорідної системи",
		"формула остроградського-ліувілля",
                "теорема про структуру загального розв'язку неоднорідної системи",
                "теорема існування та єдиності розв'язку рівняння n-го порядку зі змінними коефіцієнтами",
		"теорема про простір розв'язків однорідного рівняння n-го порядку зі змінними коефіцієнтами",
		"необхідна і достатня умова лінійної залежності розв'язків однорідного рівняння n-го порядку зі змінними коефіцієнтами",
                "теорема про кількість фундаментальних систем розв'язків однорідного рівняння n-го порядку зі змінними коефіцієнтами",
                "теорема про вигляд загального розв'язку однорідного рівняння n-го порядку зі змінними коефіцієнтами",
		"теорема про пониження порядку однорідного рівняння n-го порядку зі змінними коефіцієнтами",
		"теорема про загальний розв'язок неоднорідного рівняння n-го порядку зі змінними коефіцієнтами",
                "теорема про знаходження загального розв'язку неоднорідного рівняння n-го порядку зі змінними коефіцієнтами методом варіації сталих",
                "необхідна і достатня умова для того, щоб комплексна функція була розв'язком рівняння n-го порядку зі сталими коефіцієнтами",
		"теорема про вигляд часткового розв'язку неоднорідного рівняння n-го порядку зі сталими коефіцієнтами",
		"теорема про частковий розв'язок лінійної системи зі сталими коефіцієнтами",
                "теорема про розв'язок динамічної системи",
                "необдна і достатня умова точки рівноваги динамічної системи ",
		"необхідна і достатня умова стійкості за ляпуновим нульового розв'язку лінійної нормальної системи ",
		"необхідна і достатня умова асимптотичної стійкості нульового розв'язку лінійної нормальної системи",
                "необхідна і достатня умова асимптотичної стійкості стану рівності лінійної нормальної системи",
                "перша теорема ляпунова",
		"друга теорема ляпунова",
		"теорема про задачу коші у вигляді степеневого ряду",
                "теорема про власне значення спряженої крайової задачі",
                "теорема єдиності функції гріна для крайової задачі",
		"необхідна і достатня умова розв'язку лінійного однорідного рівняння з частинними похідними першого порядку",
		"теорема про розв'язок задачі коші для лінійного однорідного рівняння з частинними похідними першого порядку",
                "теорема про множину розв'язків квазілінійного рівняння з  частинними похідними першого порядку",
                "теорема про розв'язок задачі коші для квазілінійного однорідного рівняння з частинними похідними першого порядку"]

bot = telebot.TeleBot(<token>)
@bot.message_handler(commands=['start'])
def start(message):
    bot.send_message(message.chat.id, 'Шукаєм означення і теореми через <назва>,<назва>, наприклад "ейлер,лагранж,пеано"');

@bot.message_handler()
def check(message):
    print(message.chat.id)
    total_req = message.text
    total_req = total_req.lower()
    probable_theorem = []
    query = 5*len(total_req.split(','))
    probable_definition = []
    for el in total_req.split(','):
        if len(el)>1:
            probable_theorem.extend([s for s in theorems_db if el in s])
            probable_theorem.extend(difflib.get_close_matches(el, theorems_db, 2, 0.5))
            probable_definition.extend([s for s in definitions_db if el in s])
            probable_definition.extend(difflib.get_close_matches(el, definitions_db, 2, 0.5))
    if len(probable_theorem)>0:
        bot.send_message(message.chat.id, "Теореми:\n")
        probable_theorem = list(OrderedDict.fromkeys(probable_theorem))[:query]
        bot.send_message(message.chat.id, "\n".join(add_num(probable_theorem, theorems_db)))
        for el in probable_theorem:
            el_id = str(theorems_db.index(el)+1)
            bot.send_document(message.chat.id, "https://sspacedelivery.herokuapp.com/images/theorems/"+el_id+".jpg", None, el_id+". "+el)
    if len(probable_definition)>0:
        bot.send_message(message.chat.id, "Означення:\n")
        probable_definition = list(OrderedDict.fromkeys(probable_definition))[:query]
        bot.send_message(message.chat.id, "\n".join(add_num(probable_definition, definitions_db)))
        for el in probable_definition:
            el_id = str(definitions_db.index(el)+1)
            bot.send_document(message.chat.id, "https://sspacedelivery.herokuapp.com/images/definitions/"+el_id+".jpg", None, el_id+". "+el)
    if len(probable_definition)==0 and len(probable_theorem)==0:
        bot.send_message(message.chat.id, "Нічо не знайдено. Щасливої дороги");

def add_num(arr, base):
    result = []
    for i in range(len(arr)):
        result.append(str(base.index(arr[i])+1)+". "+arr[i])
    return result

bot.polling()
